#include <stdio.h>


/*
格式化的输入输出

printf   %[flags][width][.prec][hlL]type
scanf    %[flag]type

+---------+-----------------+
| Flag    | 含义            
+---------+-----------------+
| -       | 左对齐           
| +       | 在前面放 + 或 - 
| (space) | 正数留空        
| 0       | 0填充           
+---------+-----------------+

+-------------+-------------------------+
| width或prec | 含义            
+-------------+-------------------------+
| number      | 最小字符数           
| *           | 下一个参数是字符数
| .number     | 小数点后面的位数        
| .*          | 下一个参数是小数点后面的位数  
+-------------+-------------------------+

+----------+-----------------+
| 类型修饰  | 含义            
+----------+-----------------+
| hh       | 单个字节   char         
| h        | short 
| l        | long       
| ll       | long long
| L        | long dounble     
+---------+-----------------+


printf: %[flags][width][.prec][hlL]type
+--------+--------------------+--------+-----------------+
| type   | 用于               | type   | 用于            |
+--------+--------------------+--------+-----------------+
| i或d   | int                | g      | float           |
| u      | unsigned int       | G      | float           |
| o      | 八进制             | a或A   | 十六进制浮点    |
| x      | 十六进制           | c      | char            |
| X      | 字母大写的十六进制 | s      | 字符串          |
| f或F   | float,6            | p      | 指针            |
| e或E   | 指数               | n      | 读入/写出的个数 |
+--------+--------------------+--------+-----------------+


scanf: %[flag]type
+--------+--------------------+--------+-----------------+
| flag   | 含义               | flag   | 含义            |
+--------+--------------------+--------+-----------------+
| *      | 跳过               | l      | long, double    |
| 数字   | 最大字符数         | ll     | long long       |
| hh     | char               | L      | long double     |
| h      | short              |        |                 |
+--------+--------------------+--------+-----------------+


scanf: %[flag]type
+---------+-------------------------+--------+-----------------+
| flag    | 用于                    | flag   | 用于            |
+---------+-------------------------+--------+-----------------+
| d       | int                     | s      | 字符串(单词)    |
| 数字    | 整数,十六进制或者八进制 | [...]  | 所允许的字符    |
| hh      | char                    | p      | 指针            |
| u       | unsigned int            |        |                 |
| o       | 八进制                  |        |                 |
| x       | 十六进制                |        |                 |
| a,e,f,g | float                   |        |                 |
| c       | char                    |        |                 |
+---------+-------------------------+--------+-----------------+  
*/

/* printf的返回值：输出的字符数*/
/* scanf的返回值：输入的项目数*/
int main(int argc, char const *argv[])
{
    printf("%9d\n", 123);           //      123
    printf("%09d\n", 123);          //000000123
    printf("%-09d\n", 124);         //124
    printf("%-9d\n", 123);          //123
    printf("%-9d\n", -123);         //-123
    printf("%+-9d\n", -123);        //-123
    printf("%+9d\n", -123);         //     -123
    printf("%    d\n", 127);        // 127

    printf("==========\n");
    printf("%9.2f\n", 223.4);       //   223.40    整个输出要占用9个字符.2 表示小数点后2位
    printf("%*d\n", 6, 123);        //printf("%6d\n", 123);  

    printf("==========\n");
    printf("%hhd\n", 1234);         // -46 (1234 -> 0b010011010010 -> 0b11010010 -> 210-256)
    printf("%hhd\n", 1234);         // 1234 -> 0x4D2 -> 0xD2 -> -(0xFF-0xD2) -> 0x2C -> -46
    printf("%hhd\n", 12345);        // 12345 -> 0x3039 -> 0x39 -> 57
    printf("%hhd\n", (char)12345);  // 12345 -> 0x3039 -> 0x39 -> 57

    printf("==========\n");
    int num;
    printf("%hhd%n\n", (char)12345, &num);
    printf("%dty%n\n", 12345, &num);   // %n表示 print已经输出的字符，填到&num 所指向的变量
    printf("num=%d\n", num);
    printf("%9.2f\n", 123.0);
    // system("pause");

    scanf("%*d%d", &num);
    printf("after scanf, num=%d\n", num);

    scanf("%i", &num);                            // 0x12
    printf("%%i, after scanf, num=%d\n", num);    // %i, after scanf, num=18

    // [.^]
    //$GPRMC,004319.00,A,3016.98468,N,12006.39211,E,0.047,,130909,,,D*79
    // scanf("%*[^,],%[^,],%[^,],%[^,],%[^,],%[^,],%[^,],%[^,],%[^,],%[^,]", sTime, sAV, sLati, &sNW,sLong,&sEW,sSpeed,sAngle,sDate);


    int i1 = scanf("%i", &num);                           // 1234
    int i2 = printf("%d\n", num);                         // 1234
    printf("ret(scanf)=%d, ret(printf)=%d\n", i1, i2);    // ret(scanf)=1, ret(printf)=5  还有一个\n

    return 0;
}
